Revit 2024 API
CurveByPointsArray Constructor
Initializes a new instance of the CurveByPointsArray class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveByPointsArray()
Visual Basic
Public Sub New
Visual C++
public:
CurveByPointsArray()
See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace